In [1]:
# import dependencies
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import sklearn
%matplotlib inline

In [2]:
# read master file of energy production
total_energy_path = "Resources/Total_Renewable_energy.xlsx"
total_energy_df = pd.read_excel(total_energy_path, sheet_name = "Data")
total_energy_df.head()

,Data_Status,StateCode,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,2020F,AK,BDFDB,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,21.0,27.0,29.0,15.0,0.0,0.0
1,2020F,AK,BDPRP,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,4.0,5.0,5.0,3.0,0.0,0.0
2,2020F,AK,BFFDB,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,21.0,27.0,29.0,15.0,0.0,0.0
3,2020F,AK,BFPRP,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,4.0,5.0,5.0,3.0,0.0,0.0
4,2020F,AK,CLPRB,11263.0,11497.0,13588.0,13307.0,11622.0,13931.0,14461.0,...,33524.0,31332.0,24917.0,22944.0,17747.0,13942.0,14365.0,13752.0,14867.0,15523.0

In [3]:
# filter for only renewable energy
renewable_df = total_energy_df.loc[total_energy_df["MSN"] == "REPRB"]
renewable_df.head()

,Data_Status,StateCode,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
19,2020F,AK,REPRB,6800.0,7313.0,7453.0,7793.0,8102.0,8519.0,8328.0,...,16078.0,17796.0,18629.0,19790.0,23807.0,25155.0,23620.0,24158.0,22754.0,24682.0
48,2020F,AL,REPRB,112809.0,118021.0,125564.0,112682.0,137992.0,121888.0,121238.0,...,255850.0,242205.0,313682.0,270753.0,258955.0,230734.0,258549.0,279560.0,278142.0,288515.0
77,2020F,AR,REPRB,48104.0,51144.0,47637.0,41897.0,42732.0,46425.0,51697.0,...,124988.0,114239.0,121335.0,119830.0,117840.0,115419.0,116692.0,126121.0,133513.0,111538.0
106,2020F,AZ,REPRB,36181.0,35083.0,34533.0,34861.0,34271.0,50095.0,58060.0,...,112409.0,98262.0,99004.0,120278.0,128954.0,138522.0,149493.0,156071.0,148194.0,152046.0
135,2020F,CA,REPRB,270161.0,248178.0,329046.0,360333.0,331757.0,418518.0,375877.0,...,835660.0,702558.0,742553.0,750189.0,737527.0,929692.0,1122218.0,1026274.0,1140051.0,1013850.0

In [4]:
# remove unnecessary columns and rename the header from "StateCode" to "State"
renewable_df = renewable_df.drop(["Data_Status", "MSN"], axis = 1)
renewable_df = renewable_df.rename(columns = {"StateCode": "Abbreviation"})
renewable_df.head()

,Abbreviation,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
19,AK,6800.0,7313.0,7453.0,7793.0,8102.0,8519.0,8328.0,8457.0,8486.0,...,16078.0,17796.0,18629.0,19790.0,23807.0,25155.0,23620.0,24158.0,22754.0,24682.0
48,AL,112809.0,118021.0,125564.0,112682.0,137992.0,121888.0,121238.0,144384.0,129673.0,...,255850.0,242205.0,313682.0,270753.0,258955.0,230734.0,258549.0,279560.0,278142.0,288515.0
77,AR,48104.0,51144.0,47637.0,41897.0,42732.0,46425.0,51697.0,46124.0,64986.0,...,124988.0,114239.0,121335.0,119830.0,117840.0,115419.0,116692.0,126121.0,133513.0,111538.0
106,AZ,36181.0,35083.0,34533.0,34861.0,34271.0,50095.0,58060.0,56423.0,63456.0,...,112409.0,98262.0,99004.0,120278.0,128954.0,138522.0,149493.0,156071.0,148194.0,152046.0
135,CA,270161.0,248178.0,329046.0,360333.0,331757.0,418518.0,375877.0,473192.0,397366.0,...,835660.0,702558.0,742553.0,750189.0,737527.0,929692.0,1122218.0,1026274.0,1140051.0,1013850.0

In [5]:
# remove US from the data and sorting alphabetically
renewable_df = renewable_df[renewable_df.Abbreviation != "US"]
renewable_df = renewable_df.sort_values(by = ["Abbreviation"])
renewable_df.head()

,Abbreviation,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
19,AK,6800.0,7313.0,7453.0,7793.0,8102.0,8519.0,8328.0,8457.0,8486.0,...,16078.0,17796.0,18629.0,19790.0,23807.0,25155.0,23620.0,24158.0,22754.0,24682.0
48,AL,112809.0,118021.0,125564.0,112682.0,137992.0,121888.0,121238.0,144384.0,129673.0,...,255850.0,242205.0,313682.0,270753.0,258955.0,230734.0,258549.0,279560.0,278142.0,288515.0
77,AR,48104.0,51144.0,47637.0,41897.0,42732.0,46425.0,51697.0,46124.0,64986.0,...,124988.0,114239.0,121335.0,119830.0,117840.0,115419.0,116692.0,126121.0,133513.0,111538.0
106,AZ,36181.0,35083.0,34533.0,34861.0,34271.0,50095.0,58060.0,56423.0,63456.0,...,112409.0,98262.0,99004.0,120278.0,128954.0,138522.0,149493.0,156071.0,148194.0,152046.0
135,CA,270161.0,248178.0,329046.0,360333.0,331757.0,418518.0,375877.0,473192.0,397366.0,...,835660.0,702558.0,742553.0,750189.0,737527.0,929692.0,1122218.0,1026274.0,1140051.0,1013850.0

In [6]:
# reading the stats sheet for merge later
states_path = "Resources/Total_Renewable_energy.xlsx"
states_df = pd.read_excel(states_path, sheet_name = "State Codes")

# rename the column "State Code" into "State"
states_df = states_df.rename(columns = {"State Code": "Abbreviation",
                                       "Description": "State"})
states_df.head()

  Abbreviation       State
0           AK      Alaska
1           AL     Alabama
2           AR    Arkansas
3           AZ     Arizona
4           CA  California

In [7]:
# change abbreviations into full names
renewable_df = states_df.merge(renewable_df, how = "right", on = "Abbreviation")
renewable_df = renewable_df.drop(["Abbreviation"], axis = 1)
renewable_df.head()

,State,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,6800.0,7313.0,7453.0,7793.0,8102.0,8519.0,8328.0,8457.0,8486.0,...,16078.0,17796.0,18629.0,19790.0,23807.0,25155.0,23620.0,24158.0,22754.0,24682.0
1,Alabama,112809.0,118021.0,125564.0,112682.0,137992.0,121888.0,121238.0,144384.0,129673.0,...,255850.0,242205.0,313682.0,270753.0,258955.0,230734.0,258549.0,279560.0,278142.0,288515.0
2,Arkansas,48104.0,51144.0,47637.0,41897.0,42732.0,46425.0,51697.0,46124.0,64986.0,...,124988.0,114239.0,121335.0,119830.0,117840.0,115419.0,116692.0,126121.0,133513.0,111538.0
3,Arizona,36181.0,35083.0,34533.0,34861.0,34271.0,50095.0,58060.0,56423.0,63456.0,...,112409.0,98262.0,99004.0,120278.0,128954.0,138522.0,149493.0,156071.0,148194.0,152046.0
4,California,270161.0,248178.0,329046.0,360333.0,331757.0,418518.0,375877.0,473192.0,397366.0,...,835660.0,702558.0,742553.0,750189.0,737527.0,929692.0,1122218.0,1026274.0,1140051.0,1013850.0

In [8]:
# make the data linear
renewable_df = renewable_df.melt(id_vars = ["State"],
                                var_name = "Year",
                                value_name = "production")
renewable_df.head()

        State  Year  production
0      Alaska  1960      6800.0
1     Alabama  1960    112809.0
2    Arkansas  1960     48104.0
3     Arizona  1960     36181.0
4  California  1960    270161.0

In [9]:
# reread the file, drop the "US" values, and sort alphabetically
total_energy_path = "Resources/Total_Renewable_energy.xlsx"
total_energy_df = pd.read_excel(total_energy_path, sheet_name = "Data", dtype = str)
total_energy_df = total_energy_df.rename(columns = {"StateCode": "Abbreviation"})
total_energy_df = total_energy_df[total_energy_df.Abbreviation != "US"]
total_energy_df = total_energy_df.sort_values(by = ["Abbreviation"])
total_energy_df.head()

,Data_Status,Abbreviation,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,2020F,AK,BDFDB,0,0,0,0,0,0,0,...,0,0,0,0,21,27,29,15,0,0
28,2020F,AK,WYTCB,0,0,0,0,0,0,0,...,121,356,1386,1445,1488,1563,1305,1411,1270,1128
27,2020F,AK,WWPRB,3681,4145,4246,4383,4728,4863,5035,...,2675,2263,3357,3522,7488,8048,6937,7366,6803,7831
26,2020F,AK,WSTCB,0,0,0,0,0,0,0,...,44,35,520,641,622,412,436,456,386,407
25,2020F,AK,WDTCB,3681,4145,4246,4383,4728,4863,5035,...,2631,2228,2837,2882,6865,7636,6501,6910,6418,7423

In [10]:
# change from Abbreviations to full names for the State
total_energy_df = states_df.merge(total_energy_df, how = "right", on = "Abbreviation")
total_energy_df = total_energy_df.drop(["Abbreviation"], axis = 1)
total_energy_df.head()

,State,Data_Status,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,2020F,BDFDB,0,0,0,0,0,0,0,...,0,0,0,0,21,27,29,15,0,0
1,Alaska,2020F,WYTCB,0,0,0,0,0,0,0,...,121,356,1386,1445,1488,1563,1305,1411,1270,1128
2,Alaska,2020F,WWPRB,3681,4145,4246,4383,4728,4863,5035,...,2675,2263,3357,3522,7488,8048,6937,7366,6803,7831
3,Alaska,2020F,WSTCB,0,0,0,0,0,0,0,...,44,35,520,641,622,412,436,456,386,407
4,Alaska,2020F,WDTCB,3681,4145,4246,4383,4728,4863,5035,...,2631,2228,2837,2882,6865,7636,6501,6910,6418,7423

In [11]:
# fill NaN values with 0
total_energy_df.fillna(0, inplace=True)
total_energy_df.head()

,State,Data_Status,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,2020F,BDFDB,0,0,0,0,0,0,0,...,0,0,0,0,21,27,29,15,0,0
1,Alaska,2020F,WYTCB,0,0,0,0,0,0,0,...,121,356,1386,1445,1488,1563,1305,1411,1270,1128
2,Alaska,2020F,WWPRB,3681,4145,4246,4383,4728,4863,5035,...,2675,2263,3357,3522,7488,8048,6937,7366,6803,7831
3,Alaska,2020F,WSTCB,0,0,0,0,0,0,0,...,44,35,520,641,622,412,436,456,386,407
4,Alaska,2020F,WDTCB,3681,4145,4246,4383,4728,4863,5035,...,2631,2228,2837,2882,6865,7636,6501,6910,6418,7423

In [12]:
# check total energy consumed by state and drop unnecessary columns
consumed_df = total_energy_df[total_energy_df["MSN"] == "TETCB"]
consumed_df = consumed_df.drop(["Data_Status","MSN"], axis = 1)
consumed_df.head()

,State,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
7,Alaska,61433,72173,78812,80788,85067,87782,102696,115172,122533,...,641027,631311,597944,596523,614242,593662,601492,604644,605689,640132
41,Alabama,866594,831311,881239,913155,979212,1044616,1088204,1138573,1246669,...,1917001,1890836,1931830,1967782,1917138,1922727,1904206,1956413,1926332,1838656
64,Arkansas,425974,431586,456788,484672,527123,528740,566110,596737,635396,...,1131026,1075271,1106095,1121935,1062359,1053706,1057701,1116757,1096477,1034661
92,Arizona,282993,304835,324913,348302,369663,375200,403460,414501,456156,...,1476752,1445431,1464044,1473676,1495858,1524720,1531479,1542208,1556416,1508154
128,California,3449919,3609108,3724117,3923736,4219633,4385719,4645217,4841003,5115122,...,7651650,7446386,7532398,7445975,7525491,7647955,7766193,7865156,7790111,6922764

In [13]:
# make the data linear
consumed_df = consumed_df.melt(id_vars = ["State"], 
        var_name = "Year", 
        value_name = "consumption")
pd.set_option('display.max_rows', None)
consumed_df.head()

        State  Year consumption
0      Alaska  1960       61433
1     Alabama  1960      866594
2    Arkansas  1960      425974
3     Arizona  1960      282993
4  California  1960     3449919

In [14]:
total_energy_df.head()

,State,Data_Status,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,2020F,BDFDB,0,0,0,0,0,0,0,...,0,0,0,0,21,27,29,15,0,0
1,Alaska,2020F,WYTCB,0,0,0,0,0,0,0,...,121,356,1386,1445,1488,1563,1305,1411,1270,1128
2,Alaska,2020F,WWPRB,3681,4145,4246,4383,4728,4863,5035,...,2675,2263,3357,3522,7488,8048,6937,7366,6803,7831
3,Alaska,2020F,WSTCB,0,0,0,0,0,0,0,...,44,35,520,641,622,412,436,456,386,407
4,Alaska,2020F,WDTCB,3681,4145,4246,4383,4728,4863,5035,...,2631,2228,2837,2882,6865,7636,6501,6910,6418,7423

In [15]:
# # read total consumption file
# don't need gdp
# total_gdp_path = "Resources/Total_Consumption.xlsx"
# total_gdp_df = pd.read_excel(total_gdp_path, sheet_name = "Real GDP", dtype = str)
# total_gdp_df.fillna(0, inplace=True)
# total_gdp_df.head()

In [16]:
# # replace the header with the 2nd row
# don't need gdp
# total_gdp_df.columns = total_gdp_df.iloc[1]
# total_gdp_df = total_gdp_df.iloc[1:].reset_index(drop = True)
# total_gdp_df = total_gdp_df.drop(index=0).reset_index(drop=True)
# total_gdp_df = total_gdp_df.rename(columns = {"State": "Abbreviation"})
# total_gdp_df = total_gdp_df[total_gdp_df.Abbreviation != "US"]
# total_gdp_df = total_gdp_df.sort_values(by = ["Abbreviation"])
# total_gdp_df.head()

In [17]:
# # change from Abbreviations to full names for the State
# don't need gdp
# total_gdp_df = states_df.merge(total_gdp_df, how = "right", on = "Abbreviation")
# total_gdp_df = total_gdp_df.drop(["Abbreviation"], axis = 1)
# total_gdp_df.head()

In [18]:
# # make the data linear
# don't need gdp
# total_gdp_df = total_gdp_df.melt(id_vars = ["State"], 
#         var_name = "Year", 
#         value_name = "GDP")
# pd.set_option('display.max_rows', None)
# total_gdp_df.head()

In [19]:
# read total population file
total_population_path = "Resources/Total_Population.xlsx"
total_population_df = pd.read_excel(total_population_path, sheet_name = "Total Population", dtype = str)
total_population_df.fillna(0, inplace=True)
total_population_df.head()

,"Resident population including Armed Forces, thousand",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 52,Unnamed: 53,Unnamed: 54,Unnamed: 55,Unnamed: 56,Unnamed: 57,Unnamed: 58,Unnamed: 59,Unnamed: 60,Unnamed: 61
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,State,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
2,AK,229,238,246,256,263,271,271,278,285,...,722,731,738,737,738,743,741,737,734,732
3,AL,3274,3316,3323,3358,3395,3443,3464,3458,3446,...,4800,4817,4832,4844,4855,4867,4878,4892,4908,5025
4,AR,1789,1806,1853,1875,1897,1894,1899,1901,1902,...,2941,2953,2960,2969,2980,2992,3004,3012,3021,3012

In [20]:
# replace the header with the 2nd row
total_population_df.columns = total_population_df.iloc[1]
total_population_df = total_population_df.iloc[1:].reset_index(drop = True)
total_population_df = total_population_df.drop(index=0).reset_index(drop=True)
total_population_df = total_population_df.rename(columns = {"State": "Abbreviation"})
total_population_df = total_population_df[total_population_df.Abbreviation != "US"]
total_population_df = total_population_df.sort_values(by = ["Abbreviation"])
total_population_df.head()

1,Abbreviation,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,AK,229,238,246,256,263,271,271,278,285,...,722,731,738,737,738,743,741,737,734,732
1,AL,3274,3316,3323,3358,3395,3443,3464,3458,3446,...,4800,4817,4832,4844,4855,4867,4878,4892,4908,5025
2,AR,1789,1806,1853,1875,1897,1894,1899,1901,1902,...,2941,2953,2960,2969,2980,2992,3004,3012,3021,3012
3,AZ,1321,1407,1471,1521,1556,1584,1614,1646,1682,...,6473,6556,6635,6733,6833,6945,7048,7164,7292,7178
4,CA,15870,16497,17072,17668,18151,18585,18858,19176,19394,...,37636,37945,38254,38587,38904,39149,39338,39437,39438,39500

In [21]:
# change from Abbreviations to full names for the State
total_population_df = states_df.merge(total_population_df, how = "right", on = "Abbreviation")
total_population_df = total_population_df.drop(["Abbreviation"], axis = 1)
total_population_df.head()

,State,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,229,238,246,256,263,271,271,278,285,...,722,731,738,737,738,743,741,737,734,732
1,Alabama,3274,3316,3323,3358,3395,3443,3464,3458,3446,...,4800,4817,4832,4844,4855,4867,4878,4892,4908,5025
2,Arkansas,1789,1806,1853,1875,1897,1894,1899,1901,1902,...,2941,2953,2960,2969,2980,2992,3004,3012,3021,3012
3,Arizona,1321,1407,1471,1521,1556,1584,1614,1646,1682,...,6473,6556,6635,6733,6833,6945,7048,7164,7292,7178
4,California,15870,16497,17072,17668,18151,18585,18858,19176,19394,...,37636,37945,38254,38587,38904,39149,39338,39437,39438,39500

In [22]:
# make the data linear
total_population_df = total_population_df.melt(id_vars = ["State"], 
        var_name = "Year", 
        value_name = "population")
pd.set_option('display.max_rows', None)
total_population_df.head()

        State  Year population
0      Alaska  1960        229
1     Alabama  1960       3274
2    Arkansas  1960       1789
3     Arizona  1960       1321
4  California  1960      15870

In [23]:
# read total price file
total_price_path = "Resources/Total_Prices.xlsx"
total_price_df = pd.read_excel(total_price_path, sheet_name = "Prices", dtype = str)
total_price_df.head()

,"Total energy average price, dollars per million Btu",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 42,Unnamed: 43,Unnamed: 44,Unnamed: 45,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50,Unnamed: 51
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,State,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
2,AK,1.39,1.46,1.55,1.68,2.46,2.69,2.93,3.07,3.08,...,25.22,25.58,25.11,24.95,19.06,17,18.97,22.2,21.37,17.2
3,AL,1.37,1.51,1.61,1.84,2.5,2.83,3.21,3.76,3.99,...,20.06,19.86,18.89,18.62,15.69,14.85,15.97,16.72,16.41,14.89
4,AR,1.51,1.65,1.69,1.81,2.49,2.96,3.29,3.81,4,...,19.59,19.84,19.3,18.86,15.86,14.61,15.76,16.46,16.08,14.81

In [24]:
# replace the header with the 2nd row
total_price_df.columns = total_price_df.iloc[1]
total_price_df = total_price_df.iloc[1:].reset_index(drop = True)
total_price_df = total_price_df.drop(index=0).reset_index(drop=True)
total_price_df = total_price_df.rename(columns = {"State": "Abbreviation"})
total_price_df = total_price_df[total_price_df.Abbreviation != "US"]
total_price_df = total_price_df.sort_values(by = ["Abbreviation"])
total_price_df.head()

1,Abbreviation,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,AK,1.39,1.46,1.55,1.68,2.46,2.69,2.93,3.07,3.08,...,25.22,25.58,25.11,24.95,19.06,17,18.97,22.2,21.37,17.2
1,AL,1.37,1.51,1.61,1.84,2.5,2.83,3.21,3.76,3.99,...,20.06,19.86,18.89,18.62,15.69,14.85,15.97,16.72,16.41,14.89
2,AR,1.51,1.65,1.69,1.81,2.49,2.96,3.29,3.81,4,...,19.59,19.84,19.3,18.86,15.86,14.61,15.76,16.46,16.08,14.81
3,AZ,1.97,2.06,2.14,2.34,3.12,3.87,4.12,4.59,5.08,...,25.23,26.03,25.7,25.51,21.89,20.11,21.8,23.98,23.3,21.24
4,CA,1.74,1.81,1.91,2.13,3.03,3.47,3.8,4.27,4.58,...,24.55,25.17,25.15,25.65,22.14,20.16,21.97,24.46,24.69,23.68

In [25]:
# change from Abbreviations to full names for the State
total_price_df = states_df.merge(total_price_df, how = "right", on = "Abbreviation")
total_price_df = total_price_df.drop(["Abbreviation"], axis = 1)
total_price_df.head()

,State,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Alaska,1.39,1.46,1.55,1.68,2.46,2.69,2.93,3.07,3.08,...,25.22,25.58,25.11,24.95,19.06,17,18.97,22.2,21.37,17.2
1,Alabama,1.37,1.51,1.61,1.84,2.5,2.83,3.21,3.76,3.99,...,20.06,19.86,18.89,18.62,15.69,14.85,15.97,16.72,16.41,14.89
2,Arkansas,1.51,1.65,1.69,1.81,2.49,2.96,3.29,3.81,4,...,19.59,19.84,19.3,18.86,15.86,14.61,15.76,16.46,16.08,14.81
3,Arizona,1.97,2.06,2.14,2.34,3.12,3.87,4.12,4.59,5.08,...,25.23,26.03,25.7,25.51,21.89,20.11,21.8,23.98,23.3,21.24
4,California,1.74,1.81,1.91,2.13,3.03,3.47,3.8,4.27,4.58,...,24.55,25.17,25.15,25.65,22.14,20.16,21.97,24.46,24.69,23.68

In [26]:
# make the data linear
total_price_df = total_price_df.melt(id_vars = ["State"], 
        var_name = "Year", 
        value_name = "price")
total_price_df.head()

        State  Year price
0      Alaska  1970  1.39
1     Alabama  1970  1.37
2    Arkansas  1970  1.51
3     Arizona  1970  1.97
4  California  1970  1.74

In [27]:
# change data types for year values
consumed_df["Year"] = consumed_df["Year"].astype(str).astype(int)
consumed_df.info()

total_population_df["Year"] = total_population_df["Year"].astype(str).astype(int)
total_population_df["Year"]

# don't need gdp
# total_gdp_df["Year"] = total_gdp_df["Year"].astype(str).astype(int)
# total_gdp_df["Year"]

renewable_df["Year"] = renewable_df["Year"].astype(str).astype(int)
renewable_df.info()

total_price_df["Year"] = total_price_df["Year"].astype(str).astype(int)
total_price_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3111 entries, 0 to 3110
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   State        3111 non-null   object
 1   Year         3111 non-null   int32
 2   consumption  3111 non-null   object
dtypes: int32(1), object(2)
memory usage: 60.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3111 entries, 0 to 3110
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   State       3111 non-null   object
 1   Year        3111 non-null   int32
 2   production  3111 non-null   float64
dtypes: float64(1), int32(1), object(1)
memory usage: 60.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2601 entries, 0 to 2600
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   2601 non-null   object
 1   Year    2601 non-null   int32
 2   price   2601 non-null   object
dtypes: int32(1), object(2)
memory usage: 50.9+ KB

In [28]:
# # merge all of the dfs

# # merge production and consumption dfs
# df1 = pd.merge(renewable_df, consumed_df, on=["State", "Year"])

# don't need gdp
# # merge population and gdp dfs
# df2 = pd.merge(total_gdp_df, total_population_df, on=["State", "Year"])

# # merge df1 and df2
# df3 = pd.merge(df1, df2, on=["State", "Year"])

# # merge with prices df
# states_df_merged = pd.merge(df3, total_price_df, on=["State", "Year"])

# states_df_merged.head()

In [29]:
# merge all of the dfs

# merge production and consumption dfs
df1 = pd.merge(renewable_df, consumed_df, on=["State", "Year"])

# merge population and gdp dfs
df2 = pd.merge(total_price_df, total_population_df, on=["State", "Year"])

# merge df1 and df2
states_df_merged = pd.merge(df1, df2, on=["State", "Year"])

# merge with prices df
# states_df_merged = pd.merge(df3, total_price_df, on=["State", "Year"])

states_df_merged.head()

        State  Year  production consumption price population
0      Alaska  1970      8835.0      182039  1.39        304
1     Alabama  1970    132471.0     1393497  1.37       3451
2    Arkansas  1970     56933.0      708904  1.51       1932
3     Arizona  1970     68919.0      520401  1.97       1792
4  California  1970    521978.0     5499139  1.74      20007

In [30]:
# check data types
states_df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2601 entries, 0 to 2600
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   State        2601 non-null   object
 1   Year         2601 non-null   int32
 2   production   2601 non-null   float64
 3   consumption  2601 non-null   object
 4   price        2601 non-null   object
 5   population   2601 non-null   object
dtypes: float64(1), int32(1), object(4)
memory usage: 132.1+ KB

In [31]:
# save the files as csv
states_df_merged.to_csv("states_energy_merged.csv", index = False)